In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("../../datasets/athletes/Medals.csv",sep=",")

In [3]:
data.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [4]:
data.tail()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
8613,Olena Sadovnycha,32.0,2000,10/01/2000,0,1,0,1
8614,Kateryna Serdiuk,17.0,2000,10/01/2000,0,1,0,1
8615,Wietse van Alten,21.0,2000,10/01/2000,0,0,1,1
8616,Sandra Wagner-Sachse,31.0,2000,10/01/2000,0,0,1,1
8617,Rod White,23.0,2000,10/01/2000,0,0,1,1

##Unique athletes

In [5]:
Unique_athletes = data["Athlete"].unique().tolist()

In [6]:
len(Unique_athletes)

6956

In [7]:
data_country = pd.read_csv("../../datasets/athletes/Athelete_Country_Map.csv")

In [8]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [9]:
len(data_country)

6970

In [10]:
data_country[data_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [11]:
data_sport = pd.read_csv("../../datasets/athletes/Athelete_Sports_Map.csv")

In [12]:
data_sport.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [13]:
len(data_sport)

6975

In [14]:
data_country_dp = data_country.drop_duplicates(subset="Athlete")

In [15]:
data_main_country = pd.merge(left=data, right=data_country_dp,
                            left_on = "Athlete", right_on = "Athlete")

In [16]:
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [17]:
data_main_country_without_duplicate = data_main_country.drop_duplicates(["Athlete"])

In [18]:
data_main_country_without_duplicate.shape

(6956, 9)

In [19]:
data_main_country_without_duplicate[data_main_country_without_duplicate["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia

In [25]:
data_sport_dp = data_sport.drop_duplicates(subset="Athlete")

In [26]:
data_final = pd.merge(left=data_main_country,right=data_sport_dp,
                     left_on="Athlete", right_on="Athlete")

In [27]:
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

In [28]:
data_final.shape

(8618, 10)

# Joins types

In [31]:
out_athletes = np.random.choice(data["Athlete"], size=6, replace=False)

In [40]:
data_country_delete = data_country_dp[(~data_country_dp["Athlete"].isin(out_athletes)) &
                                     (data_country_dp["Athlete"] != "Michael Phelps")]
data_sport_delete = data_sport_dp[(~data_sport_dp["Athlete"].isin(out_athletes))&
                                   (data_sport_dp["Athlete"] != "Michael Phelps")]
data_main_country_delete = data_main_country_without_duplicate[(~data_main_country_without_duplicate["Athlete"].isin(out_athletes))&
                                                              (data_main_country_without_duplicate["Athlete"] != "Michael Phelps")]

In [41]:
data_country_delete.head()

            Athlete        Country
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States
5       Ryan Lochte  United States

##  Inner joins : The INNER JOIN keyword selects records that have matching values in both tables.

In [47]:
merged_inner = pd.merge(left = data_country_dp, right=data_country_delete, how="inner",
                        left_on="Athlete", right_on="Athlete")

In [48]:
len(merged_inner)

6949

## Left joins: The LEFT JOIN keyword returns all records from the left table (table1), and the matched records from the right table (table2). The result is NULL from the right side, if there is no match.

In [57]:
merged_left = pd.merge(left = data, right=data_country_delete, how="left",
                      left_on="Athlete", right_on="Athlete")

In [54]:
len(merged_left)

8618

In [55]:
merged_left.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,NaN
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,NaN
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,NaN
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia

## Right joins: The RIGHT JOIN keyword returns all records from the right table (table2), and the matched records from the left table (table1). The result is NULL from the left side, when there is no match.

In [63]:
merged_right = pd.merge(left = data_main_country_delete, right=data_country_dp, how="right",
                      left_on="Athlete", right_on="Athlete")

In [64]:
merged_right.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country_x,Country_y
0,Natalie Coughlin,25.0,2008.0,08/24/2008,1.0,2.0,3.0,6.0,United States,United States
1,Aleksey Nemov,24.0,2000.0,10/01/2000,2.0,1.0,3.0,6.0,Russia,Russia
2,Alicia Coutts,24.0,2012.0,08/12/2012,1.0,3.0,1.0,5.0,Australia,Australia
3,Missy Franklin,17.0,2012.0,08/12/2012,4.0,0.0,1.0,5.0,United States,United States
4,Ryan Lochte,27.0,2012.0,08/12/2012,2.0,2.0,1.0,5.0,United States,United States

In [65]:
merged_right.tail()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country_x,Country_y
6951,Tonje Larsen,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Norway
6952,Aleksandr Tuchkin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Russia
6953,Brett Anderson,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,United States
6954,Ibrahim Camejo,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Cuba
6955,Takaharu Furukawa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Japan

## Outer joins or full joins: The FULL OUTER JOIN keyword return all records when there is a match in either left (table1) or right (table2) table records

In [67]:
data_country_jc = data_country_delete.append({
    "Athlete":"Juan Manuel Ciro",
    "Country":"Colombia",   
},ignore_index=True
)

In [69]:
merged_outer = pd.merge(left=data, right=data_country_jc, how="outer",
                       left_on="Athlete", right_on="Athlete")

In [70]:
merged_outer.tail()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
8614,Kateryna Serdiuk,17.0,2000.0,10/01/2000,0.0,1.0,0.0,1.0,Ukraine
8615,Wietse van Alten,21.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Netherlands
8616,Sandra Wagner-Sachse,31.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Germany
8617,Rod White,23.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,United States
8618,Juan Manuel Ciro,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Colombia